#部分集合組(Sk)がmこあると仮定すると、S1とS2...Sm,S2とS3...Sm,...,Sm-1とSmの、1*m-1C2=Σ(1<=i<=m-1)i=(m(m-1)/2)組の共通要素をとることがわかる
#これら共通要素関係をs1==s2,s1==s3,....,s1==sm,s2==s3,s2==s4,...s2==sm,.......,sm-1==smと捉えると、(Siのある数字siとSjのある数字sjが一致という意味)
#共通要素関係について以下のことがわかる

#*si==sj、sk==slにて、i!=kまたはj!=l(<=>not((i==k)and(j==l)))ならば(si==sj)!=(sk==sl)

#(i)(i==k),(j==l),(j==k),(i==l)のいずれか一つの関係をとる時、i==kのみ時のみ考えれば十分である。
#*の前提が成り立たないとすれば、si==sj、sk==slの関係はsi==sj、si==slの関係で、si==sj==slとなり、Sに3つ同じ整数が入ることとなり矛盾
#(ii)(i==k),(j==l),(j==k),(i==l)の関係をどれもとらない時、
#*の前提が成り立たないとすれば、si==sj、sk==slの関係でsi==sj==sk==slとなり、Sに4つ同じ整数が入ることとなり矛盾
#よって、(m(m-1)/2)この共通要素は各々異なる整数で共通要素をとるということがわかる。

#一方ここまでの考察で、共通要素を取らない整数はN-(m(m-1)/2)こあることがわかるが、実はこれは0でなければならない
#共通要素を取らない整数をSaとSbに割り振ったとする
#(i)a!=bの時、sa==sbという、新たな共通要素ができる。ただ一番最初に任意の二つの集合をとってsi==sjの関係を前もって関係を構成した前提で議論しているため、どれか一つは共通要素が2つ以上になってしまい、矛盾
#(ii)a==bの時、ある集合Saに同じ数字が2つ含まれることになるが、{1,2,..N}の部分集合の組にならず矛盾。

#以上の議論からN=(m(m-1))/2<=>2N=m(m-1)が成り立つmにて、Skの数がmこになるよう、(m(m-1))/2この関係をs1==s2==1,s1==s3==2,...,s1==sm==m-1,s2==s3==m,s2==s4==m+1,...,sm-1==sm==(m(m-1))/2のように割り振ればok
#(すると、Skの要素数は自然と2N/m=m-1で揃う)

N=int(input())
num=0
flag=0
#N<=10^5なので2<=m<1000を探せば十分
for i in range(2,1000):
    if 2*N==i*(i-1):
        num=i
        flag=1
        break
if flag==0:
    print("No")
else:
    l=[[] for _ in range(num)]
    cnt=1
    for i in range(num):
        for j in range(i+1,num):
            l[i].append(cnt)
            l[j].append(cnt)
            cnt=cnt+1
    print("Yes")
    print(num)
    for i in range(num):
        print(num-1,*l[i],sep=" ")
