# 全体から引く？全体がわからん わかるの？
# abcd -> [abcd, bacd, cbad, dcba, acbd, adcb, abdc] で7
# aattはaaとttが回分になるのでそれを引いて5？
# abc -> [abc, bac, cba, acb]
# abracadabra 11文字
# 1 + 2 + .. + n - 1 = n*(n-1)/2 3文字だと3で、これにもとのやつを足して4
# 4文字だと4*3/2 + 1 = 6 + 1 = 7
# 11文字だと11*10/2 + 1 = 56 あってそう
# maxだと2 * 10^5 せいぜい19999900000
# arbacadabra を構成する方法が2通りあるということだが？？？？
# （abracadabra がオリジナル）
# たしかに 偶数からなる場合は abraとbrをの2パターンある
# 両端が同じで長さが偶数ならたしかにそうなる
# しかし両端が同じなら、というのならば奇数でも同じではないか？
# -> つまり、同じ文字に挟まれたところはすべて該当するのではないか？
# abracadabraでは {'a': 5, 'b': 2, 'r': 2, 'c': 1, 'd': 1} で、同じ文字で2つえらぶとすると a = 5*4/2 = 10, b = 1, r = 1
# これを足して全体から引くと答えになりそう
s = list(input())
d = {}
for c in s:
    if c not in d:
        d[c] = 1
    else:
        d[c] += 1
ans = len(s) * (len(s) - 1) // 2 + 1
for v in d.values():
    ans -= v * (v - 1) // 2
print(ans)