# mのとりうる範囲を考える 最小値はまあ2だろう 最大値はN-1になる（modなので）

# こんがらがったので小さい数で考える
# N = 65
# まずN-1は商1余り1を達成できる 64
# 商2の範囲 21 < x <= 32 （N//3 < x <= N//2)
# 32では余り1, 31では余り3になり、以降xを少なくしてもあまりが増えるだけなので達成できない
# 商3の範囲 16 < x <= 21
# 21では余り2, 20では余り5 達成できない
# 商4 13 <= x <16
# 16では余り1, 15では5 達成できない
# 商5の範囲 10 < x <= 13
# 13では余り0, 12では5 達成できる 64+12 = 76
# 商6の範囲 9 < x <= 10
# 10では余り5, 9は無理
# 商7はどうなる？ いちおう8 < x<= 9
# 9では余り2 達成できない
# 商8 7< x <= 8
# 8では余り1で達成できない
# 商9 6 < x <= 7だが、商>余りの最大値 になってしまい、コレ以上は無意味
# 答えは76

# N = 329
# で考える まずはN-1で 328
# 商2 109 < x <= 164
# 164では1 163では3 達成できない
# 商3 82 < x <= 109
# 109では2 108では5 達成できない
# 商4 65 < x <= 82
# 82では1 81では5 達成できない
# 商5 54 < x <= 65
# 65では4 64では9 達成できない
# 商6 47 < x <= 54
# 54では5 53では11 達成できない
# 商7 41 < x <= 47
# 47では0 46で7になり、達成できる 328+46 = 374
# 商8 36 < x <= 41
# 41では1 40では9 達成できない
# 商9 32 < x <= 36
# 36では5 35では14 達成できない
# 商10 29 < x <= 32
# 32では9 31では19 達成できない
# 商11 27 < x <= 29
# 29では10 28では21 達成できない
# 商12 25 < x <= 27
# 27では5 27では17 達成できない
# 商13 23 < x <= 25
# 25では4 25では17 達成できない
# 商14 21 < x <= 23
# 23では7 22では21 達成できない
# 商15 20 < x <= 21
# 21では14 達成できない
# 商16 19 < x <= 20
# 20では9 達成できない
# 商17 18 < x <= 19
# 19では6 達成できない
# 商18 17 < x <= 18
# 18では5 達成できない8
# これ以降は無意味
# 答えは374

# というのを愚直に実装してみる...
N = int(input())
if N <= 2:
    print(0)
    exit()
ans = N - 1
div = 2
limit = N // div
while div <= limit:
    tmp = limit
    # ここ明らかに無駄っぽい気がするんだよなー
    while True:
        if N % tmp > div or tmp <= N // (div + 1):
            break
        if N % tmp == div:
            ans += tmp
            break
        tmp -= 1
    div += 1
    limit = N // div
print(ans)