# N%2 == 0
# 2 < N < 2 * 10**5
# 全員のxorは全部足せば求まる?
# 1100のとき、0, 100の時1 0100のとき1, 100の時1
# 100, 100, 110, 110は1, 1, 0, 0

# 1110のとき1
# 110 0, 110 0, 110 0, 111 1
# 1がN, 0がMなら(N-1)個1があるのがN個、(N)個1があるのがM個
# N^2 - N + N*M Nが奇数ならかならず奇数(1) Nが偶数なら必ず偶数(0)
# 自分が1なら偶奇が変わる
# 自分が0なら偶奇は変わらない
# Nが奇数ならMが偶数なら1, Mが奇数なら0

#100なら全体で1
# 10は1, 10は1, 00は0
# 110なら全体で0
# 11 0, 10 1, 10 1

# 奇数回でた箇所と偶数回出た箇所がわかる
N = int(input())
a = [int(i) for i in input().split()]
p = 0b0
for i in range(N):
    p = p ^ a[i]
for i in range(N):
    print(p^a[i])