# 全点に対してつながってるとしたらsum(N)-自分の値になる
# N=4だと(1: 9, 2:8, 3: 7, 4: 6)
# これをN=3で考えてみる
# (1: 5, 2: 4, 3: 3)
# どうも最小値-1を目指せばできそうな雰囲気がある?
# N=4のときは2-3と1-4を断ち切ることになる
# N=5のとき(1: 14, 2: 13, 3: 12, 4: 11, 5: 10)
# 最小値-1の9を目指してみると構築できない...
# 10を目指してみると構築できる（1-4と2-3を断ち切る）
# N=6のとき(1: 20, 2: 19, 3: 18, 4: 17, 5: 16, 6: 15)
# 14を目指してみると構築できる(1-6, 2-5, 3-4を断ち切る)
# N=7のとき(1: 27: 2: 26, 3: 25, 4: 24, 5: 23, 6: 22, 7: 21)
# 21を目指してみると構築できる(1-6,2-5,3-4を断ち切る)
# どうやら見えちまったようだ
# 全点の辺の数は1+2+...N-2+N-1 = (N-1)*N//2（等差数列の和）、 断ち切る数はn/2

n = int(input())
t = [[True if i != j else False for j in range(n)] for i in range(n)]
edge_sum = n * (n - 1) // 2 - n // 2
for i in range(n // 2):
    t[i][n - i - (1 if n % 2 == 0 else 2)] = False
print(edge_sum)
for i in range(n):
    for j in range(i + 1, n):
        if t[i][j]:
            print(f"{i+1} {j+1}")
